app/views/pages/home.html.erb

SELECT "questions".* FROM "questions" WHERE (quiz_id = 1)
---
                <% @conte=0 %>
                <% for @q in Question.all do %>

SELECT COUNT(*) FROM "lessons"
---
                        </div>
                        <h4 style="padding:10px;"><%= current_user.progress %>/<%= Lesson.count %> Lessons Completed</h4>