app/views/pages/quiz.html.erb

           <h2 style="margin-bottom:50px;">You must complete Quiz <%= (current_user.progress+1) %> before you can do take this one!</h2>
        <a class="btn-lg btn-primary" style="width:100%;margin:20px;" href="/lesson/<%= Lesson.find_by_order(current_user.progress+1).id %>">GO TO THE LESSON <span class="glyphicon glyphicon-chevron-right"></span></a>
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."order" = ? LIMIT 1  [["order", 2]]

                   <% current_user.progress = @lesson.order %>
                   <% current_user.save %>
---
UPDATE "users" SET "progress" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["progress", 3], ["updated_at", "2017-10-11 16:17:04.478877"], ["id", 1]]

                        <h4 style="font-size:2em;margin:20px;line-height:40px"><%= @q.content %></h4>
                        <% for @ans in Answer.all.where('question_id = ?', @q.id) %>
---
SELECT "answers".* FROM "answers" WHERE (question_id =10)