app/views/lessons/edit.html.erb

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."order" = ? LIMIT 1  [["order", 2]]
---
           <h2 style="margin-bottom:50px;">You're not allowed in here!</h2>
           <% if (Lesson.find_by_order(current_user.progress+1)) %>

SELECT "answers".* FROM "answers" WHERE (question_id = 6)
---
              <div style="margin:30px;width:100%;margin-left:100px;margin-right:100px;">
                  <% if Answer.all.where('question_id = ?', @q.id).count == 0 %>