app/controllers/answers_controller.rb

INSERT INTO "answers" ("question_id", "content", "lesson", "correct", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["question_id", 8], ["content", "Answer"], ["lesson", 17], ["correct", "t"], ["created_at", "2017-09-13 20:51:05.196612"], ["updated_at", "2017-09-13 20:51:05.196612"]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 14]]
UPDATE "questions" SET "correct" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["correct", "Correct"], ["updated_at", "2017-10-11 14:30:30.365324"], ["id", 15]]
---
    def create
        @answer = Answer.new(post_params)
        respond_to do |f|
            if (@answer.save)
                if (@answer.correct == true)
                    @q = Question.find(@answer.question_id)
                    @q.correct = @answer.content
                    @q.save

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 3]]
---
    def destroy
    @answer = Answer.find(params[:id3])
    @answer.destroy