app/controllers/lessons_controller.rb

    def edit
        @lesson = Lesson.find(params[:id])
        @questions = Question.all.where('quiz_id = ?', params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 11]]
SELECT "questions".* FROM "questions" WHERE (quiz_id = '17')

    def update
        @lesson = Lesson.find(params[:id])

        if @lesson.update_attributes(params[:lesson].permit(:title, :description, :video, :order, :cover, :pdf))
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "lessons" SET "cover" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["cover", "http://cdn.business2community.com/wp-content/uploads/2016/12/Marketing1.jpg"], ["updated_at", "2017-10-28 17:54:58.882879"], ["id", 17]]

    def create
        @lesson = Lesson.new(post_params)
        respond_to do |f|
            if (@lesson.save)
---
INSERT INTO "lessons" ("title", "description", "video", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test title"], ["description", "test video desc"], ["video", "uwoqhteilfwwbuiebqfieufwqehw"], ["created_at", "2017-09-12 20:50:56.610289"], ["updated_at", "2017-09-12 20:50:56.610289"]]

    def destroy
    @lesson = Lesson.find(params[:id])
    Question.delete_all "quiz_id = #{params[:id]}"
    @lesson.destroy
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "questions" WHERE (quiz_id = 13)
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 3]]