app/controllers/pages_controller.rb

  def user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def home
    @perc = ((current_user.progress.to_f/Lesson.count)*100).round
---
SELECT COUNT(*) FROM "lessons"

  def lessons
    @lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 1]]

  def admin
    require "date"
    @short_users = User.all.where("created_at > ? AND completed = ? AND id != ? AND enrolled = ?", "#{6.months.ago}", "false", "1", "true").order("created_at ASC")
    @midTerm_users = User.all.where.not(id:1).where.not("lower(promo) = ?","1040onthehouse").where(created_at:7.months.ago..6.months.ago, completed: [false, "false"], auto_renew: [false, "false"], enrolled: [true, "true"]).order(:created_at)
    @long_users = User.all.where("created_at < ? AND completed = ? AND id != ? AND auto_renew = ? AND enrolled = ?", 6.months.ago, "false", 1, "false", "true").order("created_at ASC")
    @completed_users = User.all.where(completed: true).order("created_at ASC")
    @banned_users = User.all.where(banhammer: true).order("created_at ASC")
    @inactive_users = User.all.where(completed: [false, "false"], enrolled: [false, "false"]).order("created_at ASC")
    @newLesson = Lesson.new
    @lessons = Lesson.all.order("created_at DESC")
---
SELECT "lessons".* FROM "lessons"  ORDER BY created_at DESC

  def quiz
    @questions = Question.all.where("quiz_id = ?", params[:id])
    @lesson = Lesson.find(params[:id])
    @possibleAnswers = Response.all.where("user_id = ?", current_user.id)
    @respond = Response.new
    @completed = "true"
    @corr = 0

    params[:num] = @questions.count
    for @q in @questions do
      for @ans in Answer.all.where("question_id =?", @q.id) do
---
SELECT "questions".* FROM "questions" WHERE (quiz_id = '17')
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 11]]
SELECT  "responses".* FROM "responses" WHERE (user_id = 1) AND "responses"."question_id" = ? LIMIT 1  [["question_id", 10]]
SELECT COUNT(*) FROM "questions" WHERE (quiz_id = '11')
SELECT "answers".* FROM "answers" WHERE (question_id =10)