app/controllers/questions_controller.rb

INSERT INTO "questions" ("content", "quiz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "afsdkljsafd"], ["quiz_id", 17], ["created_at", "2017-09-13 20:13:52.458749"], ["updated_at", "2017-09-13 20:13:52.458749"]]
---
    def create
        url = request.referrer
        uri = URI::parse(url)
        id = uri.path.split('/')[2]
        @question = Question.new(post_params)
        @question.quiz_id = id
        respond_to do |f|
            if (@question.save)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 5]]
---
    def destroy
    @question = Question.find(params[:id3])
    @question.destroy