app/controllers/responses_controller.rb

    def create
        @respond = Response.new(post_params)
        respond_to do |f|
            if (@respond.save)
                f.html { redirect_to "/quiz/#{Question.find(@respond.question_id).quiz_id}" }
---
INSERT INTO "responses" ("question_id", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_id", 10], ["content", "5"], ["user_id", 1], ["created_at", "2017-10-10 21:45:20.197339"], ["updated_at", "2017-10-10 21:45:20.197339"]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 20]]